In [4]:
import pandas as pd
# pd.판다스 명령러 
s1 = pd.Series({
    '김':100,
    '나':141,
    '박':129,
    '아':124
})
s1.name = '수학'
print(s1)

s2 = pd.Series({
    '김':30,
    '나':5,
    '박':1239,
    '아':141
})
print(s2)

김    100
나    141
박    129
아    124
Name: 수학, dtype: int64
김      30
나       5
박    1239
아     141
dtype: int64

데이터 프레임

In [7]:
df = pd.DataFrame({
    '출생지':['한국','미국'],
    '나이':[20,30]
})
df

  출생지  나이
0  한국  20
1  미국  30

In [8]:
df['성별'] = ['여','남']
df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남

In [9]:
df.loc[2] = ['일본', 25, '여']
df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남
2  일본  25  여

In [11]:
df[['출생지']]

  출생지
0  한국
1  미국
2  일본